ezois_ka/oooezoiskaobmen/src/InformationRegisters/УчетнаяПолитикаФинансовогоУчета/УчетнаяПолитикаФинансовогоУчета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УчетнаяПолитикаФинансовогоУчета</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>МетодОценкиСтоимостиТоваров</name>
    <type>
      <types>EnumRef.МетодыОценкиСтоимостиТоваров</types>
    </type>
  </resources>
  <resources>
    <name>УчетГотовойПродукцииПоПлановойСтоимости</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УдалитьФормироватьРезервыПоСомнительнымДолгам</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УдалитьПериодичностьРезервовПоСомнительнымДолгам</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </resources>
  <resources>
    <name>ПризнаватьРасходыПоИсследованиям</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СтатьяРасходовПоИсследованиям</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
    </type>
  </resources>
  <resources>
    <name>АналитикаРасходовПоИсследованиям</name>
    <type>
      <types>Characteristic.СтатьиРасходов</types>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьВыделениеДолгосрочныхАктивовОбязательств</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДлительностьОперационногоЦикла</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПорядокУчетаВНА</name>
    <type>
      <types>EnumRef.ПорядокУчетаВНА</types>
    </type>
  </resources>
  <resources>
    <name>ПорядокУчетаВНАРегл</name>
    <type>
      <types>EnumRef.ПорядокУчетаВНАРегл</types>
    </type>
  </resources>
  <resources>
    <name>ПорядокНачисленияАмортизацииОС</name>
    <type>
      <types>EnumRef.ПорядокНачисленияАмортизации</types>
    </type>
  </resources>
  <resources>
    <name>ПорядокНачисленияАмортизацииОСРегл</name>
    <type>
      <types>EnumRef.ПорядокНачисленияАмортизации</types>
    </type>
  </resources>
  <resources>
    <name>ПорядокНачисленияАмортизацииАренда</name>
    <type>
      <types>EnumRef.ПорядокНачисленияАмортизации</types>
    </type>
  </resources>
  <resources>
    <name>ПорядокНачисленияАмортизацииАрендаРегл</name>
    <type>
      <types>EnumRef.ПорядокНачисленияАмортизации</types>
    </type>
  </resources>
  <resources>
    <name>ПорядокНачисленияАмортизацииНМА</name>
    <type>
      <types>EnumRef.ПорядокНачисленияАмортизации</types>
    </type>
  </resources>
  <resources>
    <name>ПорядокНачисленияАмортизацииНМАРегл</name>
    <type>
      <types>EnumRef.ПорядокНачисленияАмортизации</types>
    </type>
  </resources>
  <resources>
    <name>ДетализироватьМатериальныеИПостатейныеЗатратыВСебестоимостиТоваров</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УчетАрендыПоФСБУ25_2018</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>МесяцНачалаФинансовогоГода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВариантПроводокПоОбесценениюВНА</name>
    <comment>Начислять амортизацию на полную (не обесцененную) стоимость и сторнировать корректировку обесценения (истина) или начислять амортизацию на обесцененную стоимость и доначислять корректировку обесценения (ложь) по IAS 36</comment>
    <type>
      <types>EnumRef.ВариантыПроводокПоОбесценениюВНА</types>
    </type>
  </resources>
  <resources>
    <name>УчетДисконтированнойКредиторскойЗадолженностиПоставщикам</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СтатьяСписанияПроцентныхРасходов</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
    </type>
  </resources>
  <resources>
    <name>АналитикаСписанияПроцентныхРасходов</name>
    <type>
      <types>Characteristic.СтатьиРасходов</types>
    </type>
  </resources>
  <resources>
    <name>СрокДляПримененияДисконтирования</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>УчетДисконтированияРезервовПредстоящихРасходов</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СтатьяСписанияПроцентныхРасходовДисконтированияРезервов</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
    </type>
  </resources>
  <resources>
    <name>АналитикаСписанияПроцентныхРасходовДисконтированияРезервов</name>
    <type>
      <types>Characteristic.СтатьиРасходов</types>
    </type>
  </resources>
  <resources>
    <name>ФормироватьРезервыПоСомнительнымДолгам</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПериодичностьРезервовПоСомнительнымДолгам</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </resources>
  <resources>
    <name>ПорядокОценкиЗадолженности</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>ВосстанавливатьРезервПриСписанииЗапасовНаРасходы</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СтатьяПроцентныхДоходовФинансовойАренды</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиДоходов</types>
    </type>
  </resources>
  <resources>
    <name>АналитикаПроцентныхДоходовФинансовойАренды</name>
    <type>
      <types>Characteristic.СтатьиДоходов</types>
    </type>
  </resources>
  <resources>
    <name>СтатьяДоходовДляУслугФинансовойАренды</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиДоходов</types>
    </type>
  </resources>
  <resources>
    <name>АналитикаДоходовДляУслугФинансовойАренды</name>
    <type>
      <types>Characteristic.СтатьиДоходов</types>
    </type>
  </resources>
  <resources>
    <name>МетодПереоценкиОС</name>
    <type>
      <types>EnumRef.МетодыПереоценкиВНА</types>
    </type>
  </resources>
  <resources>
    <name>МетодПереоценкиНМА</name>
    <type>
      <types>EnumRef.МетодыПереоценкиВНА</types>
    </type>
  </resources>
  <resources>
    <name>ДетализироватьОтклоненияПоНаправлениямДеятельности</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДетализироватьОтклоненияПоПодразделениям</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДетализироватьОтклоненияПоСкладам</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СписыватьОтклоненияВСтоимостиПродукцииНаСебестоимостьПродаж</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НеВестиДетализациюДоДокументовПоступления</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ezois_ka/oooezoiskaobmen/src/Documents/АмортизацияОС2_4/АмортизацияОС2_4.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>АмортизацияОС2_4</name>
  <registerRecords>AccumulationRegister.ПрочиеДоходы</registerRecords>
  <registerRecords>AccumulationRegister.ПрочиеРасходы</registerRecords>
  <registerRecords>AccumulationRegister.СебестоимостьТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ДвиженияНоменклатураДоходыРасходы</registerRecords>
  <registerRecords>AccumulationRegister.ПартииПрочихРасходов</registerRecords>
  <registerRecords>AccumulationRegister.ПрочиеАктивыПассивы</registerRecords>
  <registerRecords>AccumulationRegister.ДвиженияПоПрочимАктивамПассивам</registerRecords>
  <registerRecords>InformationRegister.ОтражениеДокументовВРеглУчете</registerRecords>
  <registerRecords>AccumulationRegister.ДвиженияДоходыРасходыПрочиеАктивыПассивы</registerRecords>
  <registerRecords>AccumulationRegister.ОбесценениеВНА</registerRecords>
  <registerRecords>AccumulationRegister.ПартииРасходовНаСебестоимостьТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ФактическиеДанныеБюджетирования</registerRecords>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <registerRecords>AccumulationRegister.АмортизацияОС</registerRecords>
  <registerRecords>AccumulationRegister.ВыручкаИСебестоимостьПродаж</registerRecords>
  <registerRecords>AccumulationRegister.СтоимостьОС</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПакета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Document>

ezois_ka/oooezoiskaobmen/src/CommonModules/РасчетАмортизацииОС/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Процедуры, связанные с расчетом амортизации ОС
// 
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

#Область ЗакрытиеМесяца

// Добавляет этап в таблицу этапов закрытия месяца.
// Элементы данной таблицы являются элементами второго уровня в дереве этапов в форме закрытия месяца.
// 
// Параметры:
// 	ТаблицаЭтапов - (См. Обработки.ОперацииЗакрытияМесяца.ЗаполнитьОписаниеЭтаповЗакрытияМесяца)
// 	ТекущийРодитель - Строка - идентификатор группы.
Процедура ДобавитьЭтап(ТаблицаЭтапов,ТекущийРодитель) Экспорт
	
	НоваяСтрока = ЗакрытиеМесяцаСервер.ДобавитьЭтапВТаблицу(ТаблицаЭтапов, ТекущийРодитель,
		Перечисления.ОперацииЗакрытияМесяца.НачислениеАмортизацииОС);
		
	НоваяСтрока.ПредшествующиеЭтапы.Добавить(Перечисления.ОперацииЗакрытияМесяца.ПереходНаУчетВнеоборотныхАктивовВерсии24);
	НоваяСтрока.ПредшествующиеЭтапы.Добавить(Перечисления.ОперацииЗакрытияМесяца.АктуализацияПараметровУзловКомпонентовАмортизации);
	
	НоваяСтрока.ТекстВыполнить = НСтр("ru = 'Начислить'");
	
	НоваяСтрока.ДействиеИспользование = ЗакрытиеМесяцаСервер.ОписаниеДействия_СервернаяПроцедура(
		"РасчетАмортизацииОС.ОпределитьСтатусОперацииЗакрытияМесяца");
		
	НоваяСтрока.ДействиеВыполнить  = ЗакрытиеМесяцаСервер.ОписаниеДействия_ВыполнитьРасчет(
		"РасчетАмортизацииОС.ВыполнитьОперациюЗакрытияМесяца");
		
	НоваяСтрока.ДействиеПодробнее = ЗакрытиеМесяцаСервер.ОписаниеДействия_КлиентскаяПроцедура(
		"ВнеоборотныеАктивыКлиент.ОбработкаДействияПодробнееФормыЗакрытияМесяцаЭтапаНачислениеАмортизацииОС");
	
КонецПроцедуры

// Опредяет статус операции "НачислениеАмортизацииОС".
// 
// Параметры:
//  ПараметрыОбработчика - Структура - Параметры обработчика
Процедура ОпределитьСтатусОперацииЗакрытияМесяца(ПараметрыОбработчика) Экспорт
	
	ЗакрытиеМесяцаСервер.УвеличитьКоличествоОбработанныхДанныхДляЗамера(ПараметрыОбработчика, 1);
	
	Если НЕ ПолучитьФункциональнуюОпцию("ИспользоватьВнеоборотныеАктивы2_2")
		И НЕ ПолучитьФункциональнуюОпцию("ИспользоватьВнеоборотныеАктивы2_4") Тогда
		
		ЗакрытиеМесяцаСервер.УстановитьСостояниеОтключено(
			ПараметрыОбработчика,
			НСтр("ru = 'Учет внеоборотных активов отключен.'", ОбщегоНазначения.КодОсновногоЯзыка()));
		
		Возврат;
		
	КонецЕсли;
	
	Если ВнеоборотныеАктивы.ПроверитьНаличиеЗаданийКЗакрытиюМесяца(ПараметрыОбработчика, Метаданные.РегистрыСведений.ЗаданияКРасчетуАмортизацииОС.Имя) Тогда
		Возврат;
	КонецЕсли;
	
	ЗакрытиеМесяцаСервер.УвеличитьКоличествоОбработанныхДанныхДляЗамера(ПараметрыОбработчика, 1);
	
	Если ВнеоборотныеАктивы.ИспользуетсяУправлениеВНА_2_4(ПараметрыОбработчика.ПараметрыРасчета.НачалоПериода) Тогда
		ИмяДокумента = Метаданные.Документы.АмортизацияОС2_4.Имя;
	Иначе
		ИмяДокумента = ВнеоборотныеАктивыЛокализация.ИмяДокументаАмортизацияОС();
	КонецЕсли; 
	
	ЗакрытиеМесяцаСервер.ПроверитьНаличиеРегламентногоДокументаЭтапаЗакрытияМесяца(ПараметрыОбработчика, ИмяДокумента);
	
КонецПроцедуры

// Выполняет операцию "НачислениеАмортизацииОС".
// 
// Параметры:
//  ПараметрыОбработчика - Структура - Параметры обработчика
Процедура ВыполнитьОперациюЗакрытияМесяца(ПараметрыОбработчика) Экспорт
	
	ОписаниеЗамера = ОценкаПроизводительности.НачатьЗамерДлительнойОперации("ЗакрытиеМесяца.НачислениеАмортизацииОС");

	ПараметрыРасчета = ПараметрыОбработчика.ПараметрыРасчета;
	
	КоличествоДанных = 0;
	
	Попытка
		
		РегистрыСведений.ПакетыАмортизацииОС.СоздатьПакетыАмортизации(ПараметрыРасчета.МассивОрганизаций);
		
		КонецРасчета = КонецМесяца(ПараметрыРасчета.Период);
		НачалоРасчета = РегистрыСведений.ЗаданияКРасчетуАмортизацииОС.НачалоРасчета(ПараметрыРасчета.МассивОрганизаций);
		
		Результат = ВыполнитьОперацию(
			НачалоРасчета, 
			КонецРасчета, 
			ПараметрыРасчета.МассивОрганизаций,
			ПараметрыОбработчика.ИдентификаторРасчета);
			
		КоличествоДанных = Результат.КоличествоДанных;
		
	Исключение
		
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
		
		Для Каждого Организация Из ПараметрыРасчета.МассивОрганизаций Цикл
			
			ВнеоборотныеАктивыСлужебный.ЗарегистрироватьПроблемуВыполненияРасчета(
				Перечисления.ОперацииЗакрытияМесяца.НачислениеАмортизацииОС, 
				ПараметрыРасчета.Период,
				Организация,
				ТекстОшибки);
		
		КонецЦикла;
		
	КонецПопытки;

	ОценкаПроизводительности.ЗакончитьЗамерДлительнойОперации(ОписаниеЗамера, КоличествоДанных);
	
КонецПроцедуры

// Формирует описание технологических параметров.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Описание параметров операции закрытия месяца
Функция ОписаниеПараметровОперацииЗакрытияМесяца() Экспорт
	
	Если НЕ ПолучитьФункциональнуюОпцию("ИспользоватьВнеоборотныеАктивы2_4") Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ОписаниеПараметров = Константы.НастройкиЗакрытияМесяца.СоздатьМенеджерЗначения().ИнициализироватьОписаниеПараметровОперации();
	
	#Область МаксимальноеКоличествоЗаданий
		
	ОписаниеПараметра = ОписаниеПараметров.Добавить();
	ОписаниеПараметра.Имя = "МаксимальноеКоличествоЗаданий";
	ОписаниеПараметра.Наименование = НСтр("ru = 'Количество одновременно выполняемых заданий (потоков) расчета амортизации'");
	ОписаниеПараметра.ТипЗначения = Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(2, 0, ДопустимыйЗнак.Неотрицательный));
	ОписаниеПараметра.ДиапазонС = 1;
	ОписаниеПараметра.ЗначениеПоУмолчанию = 4;
	ОписаниеПараметра.Описание =
		НСтр("ru = 'Расчет амортизации в закрытии месяца может выполняться одновременно несколькими заданиями (потоками).
              |Увеличение количества заданий может уменьшить время расчета амортизации.
              |Количество заданий рекомендуется настраивать в зависимости от конфигурации сервера СУБД и серверов 1С:Предприятие.'");
		
	#КонецОбласти
	
	#Область РазмерПорцииДанных
		
	ОписаниеПараметра = ОписаниеПараметров.Добавить();
	ОписаниеПараметра.Имя = "РазмерПорцииДанных";
	ОписаниеПараметра.Наименование = НСтр("ru = 'Количество пакетов обрабатываемых одновременно'");
	ОписаниеПараметра.ТипЗначения = Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(3, 0, ДопустимыйЗнак.Неотрицательный));
	ОписаниеПараметра.ДиапазонС = 1;
	ОписаниеПараметра.ЗначениеПоУмолчанию = 10;
	ОписаниеПараметра.Описание =
		НСтр("ru = 'В одном задании расчет амортизации может выполняться одновременно по нескольким пакетам.
              |Увеличение количества пакетов может уменьшить время выполнения операции, но увеличить потребление памяти.
              |Количество рекомендуется настраивать в зависимости от конфигурации сервера СУБД и серверов 1С:Предприятие.'");
		
	#КонецОбласти

	Возврат ОписаниеПараметров;
	
КонецФункции

#КонецОбласти

#Область ВыполнениеОперации

// Выполняет расчет амортизации за указанный период.
//
// Параметры:
//  НачалоРасчета - Дата - Начало периода с которого требуется выполнить операцию
//  КонецРасчета - Дата - Конец периода по который требуется выполнить операцию
//  СписокОрганизаций - Массив из СправочникСсылка.Организации - Список организаций
//  ИдентификаторРасчета - УникальныйИдентификатор - идентификатор расчета
// 
// Возвращаемое значение:
//  Структура - результат расчета амортизации:
// 		* ЕстьОшибки - Булево - Истина, если были зарегистрированы ошибки во время выполнения
// 		* ТекстОшибки - Строка - Текст ошибки
// 		* КоличествоДанных - Число - Количество объектов, по которым рассчитана амортизация
//
Функция ВыполнитьОперацию(НачалоРасчета, КонецРасчета, СписокОрганизаций, ИдентификаторРасчета) Экспорт

	Результат = Новый Структура;
	Результат.Вставить("ЕстьОшибки", Ложь);
	Результат.Вставить("ТекстОшибки", "");
	Результат.Вставить("КоличествоДанных", 0);

	Если НЕ ВнеоборотныеАктивы.ИспользуетсяУправлениеВНА()
		ИЛИ НЕ ЗначениеЗаполнено(НачалоРасчета) 
		ИЛИ НачалоРасчета > КонецРасчета Тогда
			
		Возврат Результат;
	КонецЕсли; 
	
	ТекущийМесяцРасчета = НачалоМесяца(НачалоРасчета);
	ИспользоватьВнеоборотныеАктивы2_4 = ПолучитьФункциональнуюОпцию("ИспользоватьВнеоборотныеАктивы2_4");
	НачалоРасчетаАмортизацииОС2_4 = ВнеоборотныеАктивыЛокализация.ДатаНачалаУчетаВнеоборотныхАктивов2_4(); 
	
	// @skip-check query-in-loop
	// Проверка отключена т.к. операция должна выполняться "помесячно"
	Пока ТекущийМесяцРасчета <= КонецРасчета Цикл
		
		НомерДоРасчета = РегистрыСведений.ЗаданияКРасчетуАмортизацииОС.УвеличитьНомерЗадания();
	
		ЗакрытиеМесяцаСервер.ОчиститьПроблемыВыполненияРасчета(
			Перечисления.ОперацииЗакрытияМесяца.НачислениеАмортизацииОС,
			СписокОрганизаций,
			ТекущийМесяцРасчета);
		
		Если ИспользоватьВнеоборотныеАктивы2_4 И ТекущийМесяцРасчета >= НачалоРасчетаАмортизацииОС2_4 Тогда
			
			ДоступныеОрганизации = ЗакрытиеМесяцаСервер.ДоступныеДляРасчетаОрганизации(
				ТекущийМесяцРасчета, СписокОрганизаций);
			
			ЗаданияКРасчету = РегистрыСведений.ЗаданияКРасчетуАмортизацииОС.ЗаданияКРасчету(
					ТекущийМесяцРасчета, КонецМесяца(ТекущийМесяцРасчета), НомерДоРасчета, ДоступныеОрганизации);
			
			ОчередьЗаданийКРасчету = СоздатьОчередьЗаданий(
				ТекущийМесяцРасчета, СписокОрганизаций, НомерДоРасчета, ЗаданияКРасчету.МенеджерВременныхТаблиц, "ЗаданияКРасчету");
		
			РезультатВыполнения = ВнеоборотныеАктивы.ВыполнитьОчередьЗаданий(ОчередьЗаданийКРасчету, МаксимальноеКоличествоЗаданий(), ИдентификаторРасчета);
			
			Результат.ЕстьОшибки = РезультатВыполнения.ЕстьОшибки;
			Результат.ТекстОшибки = РезультатВыполнения.ТекстОшибки;
			Результат.КоличествоДанных = Результат.КоличествоДанных + РезультатВыполнения.КоличествоДанных;
			
		Иначе
			
			РасчетАмортизацииОСЛокализация.СоздатьДокументыАмортизацииОС(НачалоРасчета, СписокОрганизаций, Результат.ЕстьОшибки);
			
			Если НЕ Результат.ЕстьОшибки Тогда
				
				РегистрыСведений.ЗаданияКРасчетуАмортизацииОС.ЗафиксироватьРасчет(
					ТекущийМесяцРасчета, СписокОрганизаций, НомерДоРасчета);
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если Результат.ЕстьОшибки 
			И ЗначениеЗаполнено(Результат.ТекстОшибки) Тогда
			
			Для Каждого Организация Из СписокОрганизаций Цикл
				
				ВнеоборотныеАктивыСлужебный.ЗарегистрироватьПроблемуВыполненияРасчета(
					Перечисления.ОперацииЗакрытияМесяца.НачислениеАмортизацииОС, 
					ТекущийМесяцРасчета,
					Организация,
					Результат.ТекстОшибки);
			
			КонецЦикла;
			
		КонецЕсли;
		
		ТекущийМесяцРасчета = КонецМесяца(ТекущийМесяцРасчета) + 1;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Используется для расчета амортизации ОС в фоне.
//
// Параметры:
//  ПараметрыРасчета - см. ПараметрыВыполнения
//  ИдентификаторФормы - УникальныйИдентификатор -
// 
// Возвращаемое значение:
//  см. ДлительныеОперации.ВыполнитьФункцию
// 
Функция ЗапуститьРасчетАмортизацииВФоне(ПараметрыРасчета, ИдентификаторФормы) Экспорт

	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(ИдентификаторФормы);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Расчет амортизации ОС'");
	
	ДлительнаяОперация = ДлительныеОперации.ВыполнитьФункцию(
		ПараметрыВыполнения, "Документы.АмортизацияОС2_4.РассчитатьАмортизацию", ПараметрыРасчета);
	
	Возврат ДлительнаяОперация;

КонецФункции

// Формирует параметры необходимые для расчета амортизации
// 
// Возвращаемое значение:
//  Структура - Содержит поля:
//      * Период - Дата - Период в котором требуется рассчитать амортизацию (обязательный).
//      * СписокОрганизаций - Массив из СправочникСсылка.Организации -
//      * ЕстьОшибки - Булево - Признак наличия ошибок.
//      * ТекстОшибки - Строка - Текст исключения вызванного ошибкой.
//      * ВернутьПараметрыРасчета - Булево - Истина, если требуется вернуть, параметры расчета амортизации.
//      * АдресПараметровРасчета - Строка - Адрес временного хранилища.
//      * ЗаписатьДанные - Булево - Записать расчет амортизации.
//      * ЗафиксироватьРасчет - Булево - Зафиксировать расчет амортизации.
//      * МенеджерВременныхТаблиц - МенеджерВременныхТаблиц - Менеджер временных таблиц.
//      * ИспользуемыеТаблицы - Строка - Таблицы, которые сформированы при расчете.
//      * КоличествоОбработанныхДанных - Число - Количество данных, обработанных при расчете, используется для замера.
//      * ПараметрыРасчетаПереопределены - Булево - Истина, если параметры расчета определяются в вызывающей процедуре.
//      * НомерПакета - Число - Номер пакета.
//      * Ссылка - ДокументСсылка.АмортизацияОС2_4, ДокументСсылка.АмортизацияНМА2_4 - Ссылка на документ.
//      * Ответственный	- СправочникСсылка.Пользователи - Ответственный за документ (может быть не заполнен).
//      * Комментарий - Строка - Комментарий документа.
//      * НомерДоРасчета - Число - Номер задания до начала расчета.
//      * ПакетыАмортизации - ТаблицаЗначений - Содержит список организаций и номера пакетов (может быть не заполнен):
//             ** Организация - СправочникСсылка.Организации -
//             ** НомерПакета - Число -
//
Функция ПараметрыВыполнения() Экспорт

	ПараметрыРасчета = Новый Структура;
	ПараметрыРасчета.Вставить("Период", '000101010000');
	ПараметрыРасчета.Вставить("СписокОрганизаций", Новый Массив);
	ПараметрыРасчета.Вставить("ВернутьПараметрыРасчета", Ложь);
	ПараметрыРасчета.Вставить("АдресПараметровРасчета", Неопределено);
	ПараметрыРасчета.Вставить("ЗаписатьДанные", Истина);
	ПараметрыРасчета.Вставить("ЗафиксироватьРасчет", Ложь);
	ПараметрыРасчета.Вставить("МенеджерВременныхТаблиц", Неопределено);
	ПараметрыРасчета.Вставить("ПараметрыРасчетаПереопределены", Ложь);
	ПараметрыРасчета.Вставить("НомерДоРасчета", Неопределено);
	
	// Возвращаемые параметры
	ПараметрыРасчета.Вставить("ЕстьОшибки", Ложь);
	ПараметрыРасчета.Вставить("ТекстОшибки", "");
	ПараметрыРасчета.Вставить("ИспользуемыеТаблицы", "НачисленнаяАмортизация");
	ПараметрыРасчета.Вставить("КоличествоОбработанныхДанных", 0);
	
	// Значения, используемые при расчете из формы документа.
	ПараметрыРасчета.Вставить("НомерПакета", Неопределено);
	ПараметрыРасчета.Вставить("Ссылка", Неопределено);
	ПараметрыРасчета.Вставить("Ответственный", Неопределено);
	ПараметрыРасчета.Вставить("Комментарий", Неопределено);
	
	// Описывает по каким пакетам нужно выполнить расчет.
	ПакетыАмортизации = Новый ТаблицаЗначений;
	ПакетыАмортизации.Колонки.Добавить("Организация", Новый ОписаниеТипов("СправочникСсылка.Организации"));
	ПакетыАмортизации.Колонки.Добавить("НомерПакета", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10,0)));
	ПараметрыРасчета.Вставить("ПакетыАмортизации", ПакетыАмортизации);
	
	//@skip-check constructor-function-return-section
	Возврат ПараметрыРасчета;
	
КонецФункции

#КонецОбласти

#Область Прочее

// Определяет может ли амортизация начисляться с даты принятия к учету хотя бы у одной организации.
// 
// Параметры:
//  СписокОрганизаций - Массив из СправочникСсылка.Организации - Список организаций
//  Период - Дата - Период.
// 
// Возвращаемое значение:
//  Булево - Истина, если амортизация может начисляться с даты принятия к учету..
Функция АмортизацияМожетНачислятьсяСДатыПринятияКУчету(СписокОрганизаций, Период) Экспорт
	
	ТекстЗапроса = РасчетАмортизацииОСЛокализация.ТекстЗапросаАмортизацияМожетНачислятьсяСДатыПринятияКУчету();
	
	Если ТекстЗапроса = Неопределено Тогда
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	Организации.ГоловнаяОрганизация КАК ГоловнаяОрганизация
		|ПОМЕСТИТЬ Организации
		|ИЗ
		|	Справочник.Организации КАК Организации
		|ГДЕ
		|	Организации.Ссылка В (&СписокОрганизаций)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	1 Приоритет,
		|	ЗНАЧЕНИЕ(Перечисление.ПорядокНачисленияАмортизации.СДатыПринятияКУчету) КАК ПорядокНачисленияАмортизации
		|ИЗ
		|	РегистрСведений.УчетнаяПолитикаФинансовогоУчета.СрезПоследних(
		|		&Период, 
		|		Организация В
		|			(ВЫБРАТЬ
		|				Организации.ГоловнаяОрганизация
		|			ИЗ
		|				Организации КАК Организации)) КАК УчетнаяПолитикаФинансовогоУчета
		|ГДЕ
		|	УчетнаяПолитикаФинансовогоУчета.ПорядокНачисленияАмортизацииОС = ЗНАЧЕНИЕ(Перечисление.ПорядокНачисленияАмортизации.СДатыПринятияКУчету)
		|		ИЛИ УчетнаяПолитикаФинансовогоУчета.ПорядокНачисленияАмортизацииОСРегл = ЗНАЧЕНИЕ(Перечисление.ПорядокНачисленияАмортизации.СДатыПринятияКУчету)
		|		ИЛИ УчетнаяПолитикаФинансовогоУчета.ПорядокНачисленияАмортизацииАренда = ЗНАЧЕНИЕ(Перечисление.ПорядокНачисленияАмортизации.СДатыПринятияКУчету)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	2 Приоритет,
		|	ЗНАЧЕНИЕ(Перечисление.ПорядокНачисленияАмортизации.СоСледующегоМесяца) КАК ПорядокНачисленияАмортизации
		|ИЗ
		|	РегистрСведений.УчетнаяПолитикаФинансовогоУчета.СрезПоследних(
		|		&Период, 
		|		Организация В
		|			(ВЫБРАТЬ
		|				Организации.ГоловнаяОрганизация
		|			ИЗ
		|				Организации КАК Организации)) КАК УчетнаяПолитикаФинансовогоУчета
		|ГДЕ
		|	УчетнаяПолитикаФинансовогоУчета.ПорядокНачисленияАмортизацииОС = ЗНАЧЕНИЕ(Перечисление.ПорядокНачисленияАмортизации.СоСледующегоМесяца)
		|		ИЛИ УчетнаяПолитикаФинансовогоУчета.ПорядокНачисленияАмортизацииОСРегл = ЗНАЧЕНИЕ(Перечисление.ПорядокНачисленияАмортизации.СоСледующегоМесяца)
		|		ИЛИ УчетнаяПолитикаФинансовогоУчета.ПорядокНачисленияАмортизацииАренда = ЗНАЧЕНИЕ(Перечисление.ПорядокНачисленияАмортизации.СоСледующегоМесяца)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Приоритет";
	КонецЕсли;
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("СписокОрганизаций", СписокОрганизаций);
	Запрос.УстановитьПараметр("Период", Период);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ПорядокНачисленияАмортизации = Перечисления.ПорядокНачисленияАмортизации.СДатыПринятияКУчету;
	Иначе
		Возврат Истина;
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ВыполнениеОперации

// Рассчитать амортизацию по пакетам.
// 
// Параметры:
//  ПараметрыВыполнения - см. ПараметрыВыполнения
// 
// Возвращаемое значение:
//  Число - Количество обработанных данных
Функция РассчитатьАмортизациюПоПакетам(ПараметрыВыполнения) Экспорт
	
	Если ПараметрыВыполнения.ПакетыАмортизации.Количество() = 0 Тогда
		Возврат 0;
	КонецЕсли;
	
	РезультатРасчета = Документы.АмортизацияОС2_4.РассчитатьАмортизацию(ПараметрыВыполнения);
	
	Возврат РезультатРасчета.КоличествоОбработанныхДанных;
	
КонецФункции

// Устанавливает параметры запроса для расчета амортизации.
// 
// Параметры:
//  Запрос - Запрос -
//  ПараметрыРасчета - см. ПараметрыВыполнения
Процедура УстановитьПараметрыЗапросаДляРасчетаАмортизации(Запрос, ПараметрыРасчета = Неопределено) Экспорт

	Если ПараметрыРасчета <> Неопределено Тогда
		
		Запрос.УстановитьПараметр("НачалоМесяца", НачалоМесяца(ПараметрыРасчета.Период));
		Запрос.УстановитьПараметр("КонецМесяца",  КонецМесяца(ПараметрыРасчета.Период));
		Запрос.УстановитьПараметр("НачалоГода", НачалоГода(ПараметрыРасчета.Период));
		Запрос.УстановитьПараметр("НачалоПредыдущегоМесяца", НачалоМесяца(НачалоМесяца(ПараметрыРасчета.Период)-1));
		Запрос.УстановитьПараметр("НачалоСледующегоМесяца", НачалоМесяца(КонецМесяца(ПараметрыРасчета.Период)+1));
		Запрос.УстановитьПараметр("КонецПредыдущегоМесяца", КонецМесяца(НачалоМесяца(ПараметрыРасчета.Период)-1));
		Запрос.УстановитьПараметр("КонецПредыдущегоМесяцаГраница", Новый Граница(КонецМесяца(НачалоМесяца(ПараметрыРасчета.Период)-1), ВидГраницы.Включая));
		Запрос.УстановитьПараметр("НачалоПозапрошлогоМесяца", НачалоМесяца(ДобавитьМесяц(ПараметрыРасчета.Период, -2)));
		Запрос.УстановитьПараметр("КонецПозапрошлогоМесяца", КонецМесяца(ДобавитьМесяц(ПараметрыРасчета.Период, -2)));
		
		Если ПараметрыРасчета.Свойство("ПакетыАмортизации") Тогда
			Запрос.УстановитьПараметр("ПакетыАмортизации", ПараметрыРасчета.ПакетыАмортизации);
		КонецЕсли;

	КонецЕсли;
	
	Запрос.УстановитьПараметр("ВедетсяРегламентированныйУчетВНА", ВнеоборотныеАктивыСлужебный.ВедетсяРегламентированныйУчетВНА());
	Запрос.УстановитьПараметр("МинимальнаяОстаточнаяСтоимостьРегл", ВнеоборотныеАктивыСлужебный.МинимальнаяОстаточнаяСтоимостьРегл());
	Запрос.УстановитьПараметр("МинимальнаяОстаточнаяСтоимостьУпр", ВнеоборотныеАктивыСлужебный.МинимальнаяОстаточнаяСтоимостьУпр());
	Запрос.УстановитьПараметр("ВалютаУправленческогоУчета", Константы.ВалютаУправленческогоУчета.Получить());
	Запрос.УстановитьПараметр("ЭтоМеждународнаяВерсия", НЕ ПолучитьФункциональнуюОпцию("ЛокализацияРФ"));
	
	Запрос.УстановитьПараметр(
		"ДоначислятьКорректировкуОбесценения", 
		Перечисления.ВариантыПроводокПоОбесценениюВНА.ДоначислятьКорректировкуОбесценения);
	
	Запрос.УстановитьПараметр(
		"СторнироватьКорректировкуОбесценения", 
		Перечисления.ВариантыПроводокПоОбесценениюВНА.СторнироватьКорректировкуОбесценения);
	
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("ДокументСсылка.ПринятиеКУчетуОС2_4"));
	МассивТипов.Добавить(Тип("ДокументСсылка.ПринятиеКУчетуУзловКомпонентовАмортизации"));
	Запрос.УстановитьПараметр("ТипПринятиеКУчету", МассивТипов);

	Запрос.УстановитьПараметр("ПустыеСпособыОтраженияАмортизации", ВнеоборотныеАктивы.ПустыеСпособыОтраженияАмортизации());
	
	РасчетАмортизацииОСЛокализация.ДополнитьПараметрыЗапросаДляРасчетаАмортизации(Запрос, ПараметрыРасчета);
	
КонецПроцедуры

Функция СоздатьОчередьЗаданий(Период, СписокОрганизаций, НомерДоРасчета, МенеджерВременныхТаблиц, ИмяТаблицыОбъектов)

	ОчередьЗаданийКРасчету = ВнеоборотныеАктивы.ИнициироватьОчередьЗаданий();
	
	КоличествоПакетовВОдномЗадании = КоличествоПакетовВОдномЗадании();
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗаданияКРасчету.Организация КАК Организация,
	|	ЗаданияКРасчету.НомерПакета КАК НомерПакета
	|ИЗ
	|	ЗаданияКРасчету КАК ЗаданияКРасчету
	|
	|УПОРЯДОЧИТЬ ПО
	|	Организация,
	|	НомерПакета";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ДанныеЗадания = Неопределено;
		
		Если КоличествоПакетовВОдномЗадании > 1 Тогда
			Для Каждого СуществующиеДанныеЗадания Из ОчередьЗаданийКРасчету Цикл
				Если СуществующиеДанныеЗадания.ПараметрыЗадания.ПакетыАмортизации.Количество() < КоличествоПакетовВОдномЗадании
					И СуществующиеДанныеЗадания.ПараметрыЗадания.СписокОрганизаций.Найти(Выборка.Организация) <> Неопределено Тогда
					ДанныеЗадания = СуществующиеДанныеЗадания;
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		Если ДанныеЗадания = Неопределено Тогда
			
			ДанныеЗадания = ОчередьЗаданийКРасчету.Добавить();
			ДанныеЗадания.ПроцедураРасчета = "РасчетАмортизацииОС.РассчитатьАмортизациюПоПакетам";
			
			ПараметрыВыполнения = ПараметрыВыполнения();
			ПараметрыВыполнения.Период = НачалоМесяца(Период);
			ПараметрыВыполнения.СписокОрганизаций = Новый Массив;
			ПараметрыВыполнения.НомерДоРасчета = НомерДоРасчета;
			ПараметрыВыполнения.ЗафиксироватьРасчет = Истина;
			
			ДанныеЗадания.ПараметрыЗадания = ПараметрыВыполнения;
			
		КонецЕсли;
		
		Если ДанныеЗадания.ПараметрыЗадания.СписокОрганизаций.Найти(Выборка.Организация) = Неопределено Тогда
			ДанныеЗадания.ПараметрыЗадания.СписокОрганизаций.Добавить(Выборка.Организация);
		КонецЕсли;
		
		ПараметрыПакета = ДанныеЗадания.ПараметрыЗадания.ПакетыАмортизации.Добавить();
		ПараметрыПакета.Организация = Выборка.Организация;
		ПараметрыПакета.НомерПакета = Выборка.НомерПакета;
		
	КонецЦикла;
	
	Для Каждого ДанныеЗадания Из ОчередьЗаданийКРасчету Цикл

		Если КоличествоПакетовВОдномЗадании = 1 Тогда
			
			ДанныеЗадания.НаименованиеФоновогоЗадания = 
				СтрШаблон(НСтр("ru = 'Расчет амортизации ОС (организация ""%1"", пакет %2)'"), 
						ДанныеЗадания.ПараметрыЗадания.ПакетыАмортизации[0].Организация, 
						Формат(ДанныеЗадания.ПараметрыЗадания.ПакетыАмортизации[0].НомерПакета, "ЧЦ=4; ЧВН=; ЧГ=;"));
				
		Иначе
			 
			ДанныеЗадания.НаименованиеФоновогоЗадания = 
				СтрШаблон(НСтр("ru = 'Расчет амортизации ОС (организация ""%1"", пакеты %2-%3)'"),
					ДанныеЗадания.ПараметрыЗадания.ПакетыАмортизации[0].Организация,  
					Формат(ДанныеЗадания.ПараметрыЗадания.ПакетыАмортизации[0].НомерПакета, "ЧЦ=4; ЧВН=; ЧГ=;"), 
					Формат(ДанныеЗадания.ПараметрыЗадания.ПакетыАмортизации[ДанныеЗадания.ПараметрыЗадания.ПакетыАмортизации.Количество() -1].НомерПакета, "ЧЦ=4; ЧВН=; ЧГ=;"));
				 
		КонецЕсли;
	
	КонецЦикла;
	
	Возврат ОчередьЗаданийКРасчету;
	
КонецФункции

#КонецОбласти

#Область Прочее

Процедура СформироватьЗадания(Документ, ДанныеТаблиц) Экспорт
	
	СписокТаблиц = Новый Массив;
	СписокТаблиц.Добавить("АрендованныеОС");
	СписокТаблиц.Добавить("МестонахождениеОС");
	СписокТаблиц.Добавить("НаработкиОбъектовЭксплуатации");
	СписокТаблиц.Добавить("ПараметрыАмортизацииОСБУ");
	СписокТаблиц.Добавить("ПараметрыАмортизацииОСУУ");
	СписокТаблиц.Добавить("ПервоначальныеСведенияОС");
	СписокТаблиц.Добавить("ПорядокУчетаОС");
	СписокТаблиц.Добавить("ПорядокУчетаОСБУ");
	СписокТаблиц.Добавить("ПорядокУчетаОСУУ");
	СписокТаблиц.Добавить("СтоимостьОС");
	
	СписокДопПолей = "ОсновноеСредство";
	ТекстОбъединенияДанныхОС = ВнеоборотныеАктивы.СформироватьТекстОбъединенияДанныхДляФормированияЗадания(СписокТаблиц, ДанныеТаблиц, СписокДопПолей);
	
	СписокТаблиц = Новый Массив;
	СписокТаблиц.Добавить("ПереоценкаОС2_4");
	СписокДопПолей = Новый Структура;
	СписокДопПолей.Вставить("ОсновноеСредство", "ВнеоборотныйАктив");
	ТекстОбъединенияДанныхВНА = ВнеоборотныеАктивы.СформироватьТекстОбъединенияДанныхДляФормированияЗадания(СписокТаблиц, ДанныеТаблиц, СписокДопПолей);
	
	ТекстыДанных = Новый Массив;
	Если ТекстОбъединенияДанныхОС <> "" Тогда
		ТекстыДанных.Добавить(ТекстОбъединенияДанныхОС);
	КонецЕсли; 
	Если ТекстОбъединенияДанныхВНА <> "" Тогда
		ТекстыДанных.Добавить(ТекстОбъединенияДанныхВНА);
	КонецЕсли; 
	ТекстОбъединенияДанных = СтрСоединить(ТекстыДанных, ОбщегоНазначенияУТ.РазделительЗапросовВОбъединении());
	
	// При корректировке стоимости и амортизации нельзя до формирования движений узнать есть ли отклонения.
	// Поэтому задание формируется всегда.
	ЗарегистрироватьДокумент = 
		Документ <> Неопределено
		И ТипЗнч(Документ.Ссылка) = Тип("ДокументСсылка.КорректировкаСтоимостиИАмортизацииОС");
		
	Если ТекстОбъединенияДанных = "" И НЕ ЗарегистрироватьДокумент Тогда
		Возврат;
	КонецЕсли;
		
	Если ЗарегистрироватьДокумент Тогда
		
		СписокЗапросовОбъединение = Новый Массив;
		
		Если ТекстОбъединенияДанных <> "" Тогда
			СписокЗапросовОбъединение.Добавить(ТекстОбъединенияДанных);
		КонецЕсли; 
			
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	ИзмененныеДанные.Дата КАК Период,
		|	ИзмененныеДанные.Организация КАК Организация,
		|	ИзмененныеДанные.Ссылка КАК Документ,
		|	"""" КАК ИмяТаблицы,
		|	ИзмененныеДанные.ОсновноеСредство КАК ОсновноеСредство
		|ИЗ
		|	РегистрСведений.ДокументыПоОС КАК ИзмененныеДанные
		|ГДЕ
		|	ИзмененныеДанные.Ссылка = &Ссылка";
		
		СписокЗапросовОбъединение.Добавить(ТекстЗапроса);
		
		ТекстОбъединенияДанных = СтрСоединить(СписокЗапросовОбъединение, ОбщегоНазначенияУТ.РазделительЗапросовВОбъединении());
		
	КонецЕсли; 
		
	ТекстЗапроса = ВнеоборотныеАктивыЛокализация.ТекстЗапросаДляФормированияЗаданийКРасчетуАмортизацииОС(
						ДанныеТаблиц, ТекстОбъединенияДанных);
	
	Если ТекстЗапроса = Неопределено Тогда
		
		СписокЗапросов = Новый Массив;
		
		#Область ИзмененныеДанные
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	ИзмененныеДанные.ИмяТаблицы                      КАК ИмяТаблицы,
		|	ИзмененныеДанные.Организация                     КАК Организация,
		|	ВЫРАЗИТЬ(ИзмененныеДанные.Организация КАК Справочник.Организации).ГоловнаяОрганизация КАК ГоловнаяОрганизация,
		|	ИзмененныеДанные.ОсновноеСредство                КАК ОсновноеСредство,
		|	ИзмененныеДанные.Документ                        КАК Документ,
		|	МИНИМУМ(ИзмененныеДанные.Период)                 КАК Период
		|
		|ПОМЕСТИТЬ ВсеИзмененныеДанные
		|
		|ИЗ
		|	ТекстОбъединенияДанных_Переопределямый КАК ИзмененныеДанные
		|
		|СГРУППИРОВАТЬ ПО
		|	ИзмененныеДанные.ИмяТаблицы,
		|	ИзмененныеДанные.Организация,
		|	ВЫРАЗИТЬ(ИзмененныеДанные.Организация КАК Справочник.Организации).ГоловнаяОрганизация,
		|	ИзмененныеДанные.ОсновноеСредство,
		|	ИзмененныеДанные.Документ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВсеИзмененныеДанные.Организация                   КАК Организация,
		|	ВсеИзмененныеДанные.ОсновноеСредство              КАК ОсновноеСредство,
		|	ВсеИзмененныеДанные.Документ                      КАК Документ,
		|
		|	МИНИМУМ(ВЫБОР 
		|				КОГДА ТИПЗНАЧЕНИЯ(ВсеИзмененныеДанные.Документ) = ТИП(Документ.ВводОстатковВнеоборотныхАктивов2_4)
		|						ИЛИ &ДвиженияЗаписываютсяПриРасчетеСтоимостиВНА
		|						ИЛИ &ДвиженияЗаписываютсяПриАктуализацияДвиженийПоВНА
		|						ИЛИ &ДвиженияЗаписываютсяПриОтложенномФормированииДвижений
		|
		|					ТОГДА ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(ВсеИзмененныеДанные.Период, МЕСЯЦ), МЕСЯЦ, 1) 
		|
		|				ИНАЧЕ НАЧАЛОПЕРИОДА(ВсеИзмененныеДанные.Период, МЕСЯЦ)
		| 
		|			КОНЕЦ) КАК ПериодБУ,
		|
		|	МИНИМУМ(ВЫБОР 
		|				КОГДА ТИПЗНАЧЕНИЯ(ВсеИзмененныеДанные.Документ) = ТИП(Документ.ВводОстатковВнеоборотныхАктивов2_4)
		|						ИЛИ &ДвиженияЗаписываютсяПриРасчетеСтоимостиВНА
		|						ИЛИ &ДвиженияЗаписываютсяПриАктуализацияДвиженийПоВНА
		|						ИЛИ &ДвиженияЗаписываютсяПриОтложенномФормированииДвижений
		|
		|					ТОГДА ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(ВсеИзмененныеДанные.Период, МЕСЯЦ), МЕСЯЦ, 1) 
		|
		|				ИНАЧЕ НАЧАЛОПЕРИОДА(ВсеИзмененныеДанные.Период, МЕСЯЦ)
		| 
		|			КОНЕЦ) КАК ПериодУУ
		|
		|ПОМЕСТИТЬ ИзмененныеДанные
		|
		|ИЗ
		|	ВсеИзмененныеДанные КАК ВсеИзмененныеДанные
		|
		|СГРУППИРОВАТЬ ПО
		|	ВсеИзмененныеДанные.Организация,
		|	ВсеИзмененныеДанные.ОсновноеСредство,
		|	ВсеИзмененныеДанные.Документ
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Организация,
		|	ОсновноеСредство";
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ТекстОбъединенияДанных_Переопределямый", "(" + ТекстОбъединенияДанных + ")");
		СписокЗапросов.Добавить(ТекстЗапроса);
		#КонецОбласти
		
		#Область ФормированиеЗаданий
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	ИзмененныеДанные.Организация,
		|	ИзмененныеДанные.Документ,
		|	ЕСТЬNULL(ПакетыАмортизацииОС.НомерПакета, 0) КАК НомерПакета,
		|	МИНИМУМ(ВЫБОР 
		|				КОГДА ИзмененныеДанные.ПериодБУ <= ИзмененныеДанные.ПериодУУ
		|						ИЛИ ИзмененныеДанные.ПериодУУ ЕСТЬ NULL
		|					ТОГДА ИзмененныеДанные.ПериодБУ
		|				ИНАЧЕ ИзмененныеДанные.ПериодУУ
		|			КОНЕЦ) КАК Месяц
		|ИЗ
		|	ИзмененныеДанные КАК ИзмененныеДанные
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПакетыАмортизацииОС КАК ПакетыАмортизацииОС
		|		ПО (ПакетыАмортизацииОС.Организация = ИзмененныеДанные.Организация)
		|			И (ПакетыАмортизацииОС.ОсновноеСредство = ИзмененныеДанные.ОсновноеСредство)
		|
		|СГРУППИРОВАТЬ ПО
		|	ИзмененныеДанные.Организация,
		|	ИзмененныеДанные.Документ,
		|	ЕСТЬNULL(ПакетыАмортизацииОС.НомерПакета, 0)";
		
		СписокЗапросов.Добавить(ТекстЗапроса);
		
		#КонецОбласти
		
		ТекстЗапроса = СтрСоединить(СписокЗапросов, ОбщегоНазначения.РазделительПакетаЗапросов());
	
	КонецЕсли; 
	
	ИспользуемыеВременныеТаблицы = ОбщегоНазначенияУТ.СписокВременныхТаблиц(ДанныеТаблиц.МенеджерВременныхТаблиц);
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.МенеджерВременныхТаблиц = ДанныеТаблиц.МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ДатаНачалаУчета24", ВнеоборотныеАктивыЛокализация.ДатаНачалаУчетаВнеоборотныхАктивов2_4());
	Запрос.УстановитьПараметр("Ссылка", Документ.Ссылка);
	
	Запрос.УстановитьПараметр(
		"ДвиженияЗаписываютсяПриРасчетеСтоимостиВНА", 
		РасчетСтоимостиВНА.ДвиженияЗаписываютсяПриВыполненииОперации(Документ));
	
	Запрос.УстановитьПараметр(
		"ДвиженияЗаписываютсяПриОтложенномФормированииДвижений", 
		ОтложенноеФормированиеДвиженийВНА.ДвиженияЗаписываютсяПриВыполненииОперации(Документ));
	
	Запрос.УстановитьПараметр(
		"ДвиженияЗаписываютсяПриАктуализацияДвиженийПоВНА", 
		РасчетСтоимостиВНА.ДвиженияЗаписываютсяПриАктуализацияДвиженийПоВНА(Документ));
	
	УстановитьПривилегированныйРежим(Истина);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ОбщегоНазначенияУТ.УничтожитьВременныеТаблицы(ДанныеТаблиц.МенеджерВременныхТаблиц,, ИспользуемыеВременныеТаблицы);
	
	РегистрыСведений.ЗаданияКРасчетуАмортизацииОС.СоздатьЗаписиРегистраПоДаннымВыборки(РезультатЗапроса.Выбрать());
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

Функция МаксимальноеКоличествоЗаданий()

	ЗначенияПараметров = Константы.НастройкиЗакрытияМесяца.СоздатьМенеджерЗначения().УстановленныеЗначенияПараметровОперации(
  							Перечисления.ОперацииЗакрытияМесяца.НачислениеАмортизацииОС);
							
	Возврат ЗначенияПараметров.МаксимальноеКоличествоЗаданий;

КонецФункции

Функция КоличествоПакетовВОдномЗадании()

	ЗначенияПараметров = Константы.НастройкиЗакрытияМесяца.СоздатьМенеджерЗначения().УстановленныеЗначенияПараметровОперации(
  							Перечисления.ОперацииЗакрытияМесяца.НачислениеАмортизацииОС);
							
	Возврат ЗначенияПараметров.РазмерПорцииДанных;

КонецФункции

#КонецОбласти

#КонецОбласти
